benchmarks/link_read/10_mb_read__100_latency_tcp.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

fio: terminating on signal 2

10_mb_read: (groupid=0, jobs=1): err= 0: pid=145784: Sun Feb 16 23:43:40 2025
  read: IOPS=4, BW=19.7KiB/s (20.1kB/s)(292KiB/14857msec)
    clat (usec): min=201361, max=203301, avg=202105.70, stdev=370.73
     lat (usec): min=201363, max=203303, avg=202108.19, stdev=370.90
    clat percentiles (msec):
     |  1.00th=[  203],  5.00th=[  203], 10.00th=[  203], 20.00th=[  203],
     | 30.00th=[  203], 40.00th=[  203], 50.00th=[  203], 60.00th=[  203],
     | 70.00th=[  203], 80.00th=[  203], 90.00th=[  203], 95.00th=[  203],
     | 99.00th=[  203], 99.50th=[  203], 99.90th=[  203], 99.95th=[  203],
     | 99.99th=[  203]
   bw (  KiB/s): min=    8, max=   24, per=96.68%, avg=19.59, stdev= 4.58, samples=29
   iops        : min=    2, max=    6, avg= 4.90, stdev= 1.14, samples=29
  lat (msec)   : 250=100.00%
  cpu          : usr=0.02%, sys=0.03%, ctx=74, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=73,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=19.7KiB/s (20.1kB/s), 19.7KiB/s-19.7KiB/s (20.1kB/s-20.1kB/s), io=292KiB (299kB), run=14857-14857msec