benchmarks/link_read/10_mb_read__10_latency_tcp_correct.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=224351: Mon Feb 17 00:40:04 2025
  read: IOPS=43, BW=175KiB/s (180kB/s)(10.0MiB/58365msec)
    clat (usec): min=21288, max=46456, avg=22764.86, stdev=816.28
     lat (usec): min=21290, max=46457, avg=22767.61, stdev=816.74
    clat percentiles (usec):
     |  1.00th=[21627],  5.00th=[21890], 10.00th=[22152], 20.00th=[22152],
     | 30.00th=[22414], 40.00th=[22414], 50.00th=[22676], 60.00th=[22938],
     | 70.00th=[22938], 80.00th=[23200], 90.00th=[23462], 95.00th=[23725],
     | 99.00th=[25297], 99.50th=[26084], 99.90th=[27132], 99.95th=[27132],
     | 99.99th=[46400]
   bw (  KiB/s): min=  160, max=  184, per=99.75%, avg=175.58, stdev= 4.01, samples=116
   iops        : min=   40, max=   46, avg=43.84, stdev= 1.03, samples=116
  lat (msec)   : 50=100.00%
  cpu          : usr=0.16%, sys=0.31%, ctx=2731, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=175KiB/s (180kB/s), 175KiB/s-175KiB/s (180kB/s-180kB/s), io=10.0MiB (10.5MB), run=58365-58365msec