benchmarks/link_read/10_mb_read__10_loss_tcp.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=151705: Sun Feb 16 23:56:33 2025
  read: IOPS=52, BW=211KiB/s (216kB/s)(10.0MiB/48541msec)
    clat (usec): min=579, max=3143.2k, avg=18940.74, stdev=90985.28
     lat (usec): min=579, max=3143.2k, avg=18942.45, stdev=90985.25
    clat percentiles (usec):
     |  1.00th=[    685],  5.00th=[    791], 10.00th=[    938],
     | 20.00th=[   1205], 30.00th=[   1450], 40.00th=[   1696],
     | 50.00th=[   1958], 60.00th=[   2343], 70.00th=[   3884],
     | 80.00th=[   9110], 90.00th=[  13829], 95.00th=[  23200],
     | 99.00th=[ 267387], 99.50th=[ 513803], 99.90th=[ 700449],
     | 99.95th=[ 708838], 99.99th=[3137340]
   bw (  KiB/s): min=    8, max=  630, per=100.00%, avg=224.87, stdev=164.41, samples=91
   iops        : min=    2, max=  157, avg=56.18, stdev=41.08, samples=91
  lat (usec)   : 750=3.36%, 1000=8.87%
  lat (msec)   : 2=39.06%, 4=18.87%, 10=12.30%, 20=12.07%, 50=0.62%
  lat (msec)   : 250=1.68%, 500=2.62%, 750=0.51%, >=2000=0.04%
  cpu          : usr=0.15%, sys=0.25%, ctx=2663, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=211KiB/s (216kB/s), 211KiB/s-211KiB/s (216kB/s-216kB/s), io=10.0MiB (10.5MB), run=48541-48541msec