benchmarks/link_read/10_mb_read__15_latency_tcp_correct.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=226931: Mon Feb 17 00:41:59 2025
  read: IOPS=30, BW=120KiB/s (123kB/s)(10.0MiB/85204msec)
    clat (usec): min=31627, max=65843, avg=33238.07, stdev=858.07
     lat (usec): min=31629, max=65846, avg=33241.70, stdev=858.54
    clat percentiles (usec):
     |  1.00th=[31851],  5.00th=[32375], 10.00th=[32637], 20.00th=[32900],
     | 30.00th=[32900], 40.00th=[33162], 50.00th=[33162], 60.00th=[33424],
     | 70.00th=[33424], 80.00th=[33424], 90.00th=[33817], 95.00th=[33817],
     | 99.00th=[35390], 99.50th=[36439], 99.90th=[38011], 99.95th=[38536],
     | 99.99th=[65799]
   bw (  KiB/s): min=  112, max=  128, per=99.85%, avg=120.23, stdev= 2.13, samples=170
   iops        : min=   28, max=   32, avg=30.02, stdev= 0.58, samples=170
  lat (msec)   : 50=99.96%, 100=0.04%
  cpu          : usr=0.17%, sys=0.25%, ctx=2711, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=120KiB/s (123kB/s), 120KiB/s-120KiB/s (123kB/s-123kB/s), io=10.0MiB (10.5MB), run=85204-85204msec