benchmarks/link_read/10_mb_read__15_loss_quic.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=165456: Mon Feb 17 00:09:53 2025
  read: IOPS=24, BW=96.2KiB/s (98.5kB/s)(10.0MiB/106484msec)
    clat (usec): min=628, max=1619.6k, avg=41575.70, stdev=123074.25
     lat (usec): min=628, max=1619.6k, avg=41577.35, stdev=123074.29
    clat percentiles (usec):
     |  1.00th=[    685],  5.00th=[    840], 10.00th=[   1123],
     | 20.00th=[   1434], 30.00th=[   1729], 40.00th=[   2057],
     | 50.00th=[   2606], 60.00th=[   7308], 70.00th=[  10683],
     | 80.00th=[  14877], 90.00th=[ 214959], 95.00th=[ 261096],
     | 99.00th=[ 650118], 99.50th=[ 700449], 99.90th=[1551893],
     | 99.95th=[1585447], 99.99th=[1619002]
   bw (  KiB/s): min=    7, max=  432, per=100.00%, avg=103.97, stdev=72.60, samples=196
   iops        : min=    1, max=  108, avg=25.97, stdev=18.16, samples=196
  lat (usec)   : 750=2.89%, 1000=4.88%
  lat (msec)   : 2=30.47%, 4=17.97%, 10=11.76%, 20=18.28%, 50=2.54%
  lat (msec)   : 250=4.06%, 500=5.55%, 750=1.37%, 1000=0.08%, 2000=0.16%
  cpu          : usr=0.06%, sys=0.11%, ctx=2618, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=96.2KiB/s (98.5kB/s), 96.2KiB/s-96.2KiB/s (98.5kB/s-98.5kB/s), io=10.0MiB (10.5MB), run=106484-106484msec