benchmarks/link_read/10_mb_read__1_latency_quic.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=176343: Mon Feb 17 00:21:33 2025
  read: IOPS=181, BW=728KiB/s (745kB/s)(10.0MiB/14073msec)
    clat (usec): min=3364, max=11352, avg=5465.42, stdev=957.05
     lat (usec): min=3365, max=11354, avg=5468.21, stdev=957.27
    clat percentiles (usec):
     |  1.00th=[ 3851],  5.00th=[ 4293], 10.00th=[ 4490], 20.00th=[ 4686],
     | 30.00th=[ 4883], 40.00th=[ 5080], 50.00th=[ 5276], 60.00th=[ 5473],
     | 70.00th=[ 5800], 80.00th=[ 6194], 90.00th=[ 6783], 95.00th=[ 7242],
     | 99.00th=[ 8455], 99.50th=[ 9241], 99.90th=[10159], 99.95th=[10290],
     | 99.99th=[11338]
   bw (  KiB/s): min=  632, max=  776, per=100.00%, avg=728.29, stdev=33.24, samples=28
   iops        : min=  158, max=  194, avg=182.00, stdev= 8.41, samples=28
  lat (msec)   : 4=1.80%, 10=98.09%, 20=0.12%
  cpu          : usr=0.77%, sys=1.22%, ctx=3060, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=728KiB/s (745kB/s), 728KiB/s-728KiB/s (745kB/s-745kB/s), io=10.0MiB (10.5MB), run=14073-14073msec