benchmarks/link_read/10_mb_read__1_latency_tcp.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=173591: Mon Feb 17 00:21:03 2025
  read: IOPS=285, BW=1142KiB/s (1169kB/s)(10.0MiB/8969msec)
    clat (usec): min=2675, max=8795, avg=3478.29, stdev=608.42
     lat (usec): min=2675, max=8796, avg=3480.61, stdev=608.65
    clat percentiles (usec):
     |  1.00th=[ 2835],  5.00th=[ 2966], 10.00th=[ 3032], 20.00th=[ 3097],
     | 30.00th=[ 3130], 40.00th=[ 3163], 50.00th=[ 3261], 60.00th=[ 3359],
     | 70.00th=[ 3589], 80.00th=[ 3818], 90.00th=[ 4228], 95.00th=[ 4490],
     | 99.00th=[ 5866], 99.50th=[ 6521], 99.90th=[ 8029], 99.95th=[ 8717],
     | 99.99th=[ 8848]
   bw (  KiB/s): min= 1048, max= 1192, per=100.00%, avg=1149.47, stdev=41.06, samples=17
   iops        : min=  262, max=  298, avg=287.29, stdev=10.24, samples=17
  lat (msec)   : 4=85.98%, 10=14.02%
  cpu          : usr=0.76%, sys=1.91%, ctx=2730, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1142KiB/s (1169kB/s), 1142KiB/s-1142KiB/s (1169kB/s-1169kB/s), io=10.0MiB (10.5MB), run=8969-8969msec