benchmarks/link_read/10_mb_read__1_loss_tcp.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=159913: Mon Feb 17 00:03:19 2025
  read: IOPS=539, BW=2156KiB/s (2208kB/s)(10.0MiB/4749msec)
    clat (usec): min=603, max=260692, avg=1835.99, stdev=5370.78
     lat (usec): min=603, max=260693, avg=1837.66, stdev=5370.84
    clat percentiles (usec):
     |  1.00th=[   709],  5.00th=[   799], 10.00th=[   865], 20.00th=[   947],
     | 30.00th=[  1029], 40.00th=[  1139], 50.00th=[  1319], 60.00th=[  1516],
     | 70.00th=[  1680], 80.00th=[  1893], 90.00th=[  2507], 95.00th=[  3785],
     | 99.00th=[ 10159], 99.50th=[ 12256], 99.90th=[ 13435], 99.95th=[ 13435],
     | 99.99th=[261096]
   bw (  KiB/s): min=  880, max= 2672, per=99.52%, avg=2146.22, stdev=533.90, samples=9
   iops        : min=  220, max=  668, avg=536.56, stdev=133.48, samples=9
  lat (usec)   : 750=2.30%, 1000=24.38%
  lat (msec)   : 2=56.21%, 4=12.54%, 10=3.52%, 20=1.02%, 500=0.04%
  cpu          : usr=1.37%, sys=2.40%, ctx=2800, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2156KiB/s (2208kB/s), 2156KiB/s-2156KiB/s (2208kB/s-2208kB/s), io=10.0MiB (10.5MB), run=4749-4749msec